pmo-dataset/variations/graphviz_with_ids/13.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Resolve complaint"];
  "Task_2" [label="Approve and notify\ncustomer"];
  "Task_3" [label="Process\nreimbursement"];
  "Task_4" [label="Provide feedback"];
  "Task_5" [label="Log complaint"];
  "Task_6" [label="Assign complaint to\nrelevant department"];
  "Task_7" [label="File complaint"];
  "Task_8" [label="Reject and notify\ncustomer"];
  "Task_9" [label="Review complaint\ndetails"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];

  "StartNoneEvent_1" -> "Task_7";
  "ExclusiveGateway_3" -> "Task_1";
  "Task_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Task_4";
  "ExclusiveGateway_1" -> "EndNoneEvent_1";
  "ExclusiveGateway_4" -> "ExclusiveGateway_1";
  "ExclusiveGateway_2" -> "Task_2";
  "Task_8" -> "ExclusiveGateway_3";
  "Task_5" -> "Task_6";
  "Task_9" -> "ExclusiveGateway_2";
  "Task_4" -> "ExclusiveGateway_1";
  "Task_7" -> "Task_5";
  "ExclusiveGateway_2" -> "Task_8";
  "Task_3" -> "ExclusiveGateway_3";
  "Task_2" -> "Task_3";
  "Task_6" -> "Task_9";
}
